<a href="https://colab.research.google.com/github/tastiz/hello-world/blob/master/df_manipulating.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [22]:
from sqlalchemy import create_engine

postgres_user = 'dabc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'baseball'

engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

import pandas as pd

sql = 'SELECT p.playerid, birthyear, birthcountry, deathyear, namefirst, namelast, weight, height, bats, throws, yearid, teamid, lgid, salary FROM people p join salaries s on p.playerid = s.playerid'

players_df = pd.read_sql_query(sql, con=engine)

#stops the query
engine.dispose()

#returns first two rows of the data set
#players_df.head(2)

#no parantheses
#players_df.shape

#returns information of each colmuns data type
#players_df.info()

#reveals the min, max, mean, and std deviation as well as count for data
#players_df.describe()

#no parantheses just like .shape function
#players_df.columns

#creates a new column based on information for other columns
players_df = players_df.assign(bmi = (703 * players_df.weight) / (players_df.height**2))
players_df.head()

#adds a new column and fills accordingly
players_df['Type of Guy'] = 'Big Guy'
players_df.head(2)

players_df_changed = players_df.drop(['Type of Guy'], axis=1)

#print('The columns of the new DataFrame')
#print(players_df_changed.columns)

#print('The columns of the original DataFrame')
#print(players_df.columns)

# Alternatively, modify the DataFrame inplace without making a new dataset
players_df.drop(['Type of Guy'], axis=1, inplace=True)
#print('The columns of the DataFrame after deleting inplace')
#print(players_df.columns)

#returns row 1 as an array
players_df.iloc[1]
#returns row 1 indexed
players_df.iloc[[1]]

    playerid  birthyear birthcountry  deathyear  ... teamid lgid  salary        bmi
1  bedrost01       1957          USA        NaN  ...    ATL   NL  550000  24.995556

[1 rows x 15 columns]

SELECT p.playerid, birthyear, birthcountry, deathyear, namefirst, namelast, weight, height, bats, throws, yearid, teamid, lgid, salary 
FROM people p 
join salaries s on p.playerid = s.playerid'